In [3]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [4]:
df = pd.read_csv('data/ab_data.zip')

In [5]:
df

        user_id   timestamp group  converted
0        851104  2017-01-21     A          0
1        804228  2017-01-12     A          0
2        661590  2017-01-11     B          0
3        853541  2017-01-08     B          0
4        864975  2017-01-21     A          1
...         ...         ...   ...        ...
290477   751197  2017-01-03     A          0
290478   945152  2017-01-12     A          0
290479   734608  2017-01-22     A          0
290480   697314  2017-01-15     A          0
290481   715931  2017-01-16     B          0

[290482 rows x 4 columns]

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 290482 entries, 0 to 290481
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   user_id    290482 non-null  int64
 1   timestamp  290482 non-null  object
 2   group      290482 non-null  object
 3   converted  290482 non-null  int64
dtypes: int64(2), object(2)
memory usage: 8.9+ MB

In [7]:
# Конвертирую datetime
df['timestamp'] = pd.to_datetime(df['timestamp'])

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 290482 entries, 0 to 290481
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   user_id    290482 non-null  int64
 1   timestamp  290482 non-null  datetime64[ns]
 2   group      290482 non-null  object
 3   converted  290482 non-null  int64
dtypes: datetime64[ns](1), int64(2), object(1)
memory usage: 8.9+ MB

In [9]:
a_df = df[df['group'] == 'A']

In [10]:
a_df

        user_id  timestamp group  converted
0        851104 2017-01-21     A          0
1        804228 2017-01-12     A          0
4        864975 2017-01-21     A          1
5        936923 2017-01-10     A          0
7        719014 2017-01-17     A          0
...         ...        ...   ...        ...
290475   718310 2017-01-21     A          0
290477   751197 2017-01-03     A          0
290478   945152 2017-01-12     A          0
290479   734608 2017-01-22     A          0
290480   697314 2017-01-15     A          0

[145241 rows x 4 columns]

In [11]:
b_df = df[df['group'] == 'B']

In [12]:
b_df

        user_id  timestamp group  converted
2        661590 2017-01-11     B          0
3        853541 2017-01-08     B          0
6        679687 2017-01-19     B          1
8        817355 2017-01-04     B          1
9        839785 2017-01-15     B          1
...         ...        ...   ...        ...
290466   677163 2017-01-03     B          0
290469   925675 2017-01-07     B          0
290472   643562 2017-01-02     B          0
290476   822004 2017-01-04     B          0
290481   715931 2017-01-16     B          0

[145241 rows x 4 columns]

In [14]:
df.groupby(['timestamp', 'group']).agg({'user_id': 'count', 'converted': 'sum'}).reset_index()

    timestamp group  user_id  converted
0  2017-01-02     A     2851        357
1  2017-01-02     B     2848        339
2  2017-01-03     A     6584        749
3  2017-01-03     B     6620        754
4  2017-01-04     A     6573        797
5  2017-01-04     B     6538        763
6  2017-01-05     A     6419        791
7  2017-01-05     B     6509        743
8  2017-01-06     A     6604        762
9  2017-01-06     B     6735        834
10 2017-01-07     A     6595        793
11 2017-01-07     B     6604        765
12 2017-01-08     A     6692        793
13 2017-01-08     B     6702        810
14 2017-01-09     A     6624        792
15 2017-01-09     B     6619        783
16 2017-01-10     A     6657        752
17 2017-01-10     B     6690        844
18 2017-01-11     A     6686        790
19 2017-01-11     B     6672        772
20 2017-01-12     A     6508        794
21 2017-01-12     B     6631        815
22 2017-01-13     A     6562        769
23 2017-01-13     B     6510        730
24 2017-01-14     A     6555        830
25 2017-01-14     B     6607        791
26 2017-01-15     A     6710        814
27 2017-01-15     B     6556        743
28 2017-01-16     A     6604        801
29 2017-01-16     B     6526        779
30 2017-01-17     A     6606        816
31 2017-01-17     B     6527        828
32 2017-01-18     A     6484        807
33 2017-01-18     B     6602        814
34 2017-01-19     A     6562        787
35 2017-01-19     B     6555        758
36 2017-01-20     A     6536        752
37 2017-01-20     B     6690        786
38 2017-01-21     A     6765        851
39 2017-01-21     B     6544        757
40 2017-01-22     A     6587        782
41 2017-01-22     B     6649        782
42 2017-01-23     A     6717        847
43 2017-01-23     B     6627        802
44 2017-01-24     A     3760        441
45 2017-01-24     B     3680        446